const headerLinksData = {
  links: [
    {
      id: 0,
      href: '#about',
      text: 'О нас'
    },
    {
      id: 1,
      href: '#competences',
      text: 'Компетенции'
    },
    {
      id: 2,
      href: '#projects',
      text: 'Проекты'
    }
  ]
}

const intro = {
  title: 'Системные решения',
  subtitle: 'Мы соединяем физический и Онлайн миры',
  buttonText: 'Узнать больше'
}

const target = {
  title: 'Наша цель',
  text:
    'Опираясь на многолетний опыт реализации технических решений в области создания информационной технологий для объектов промышленной, информационной и научной инфраструктуры, компания «Системные решения» предоставляет промышленным предприятиям, научным организациям и органам государственной власти полный комплекс инжиниринговых и IT услуг.'
}

const coreValues = {
  title: 'Наши ценности',
  cardInfo: [
    {
      id: 0,
      title: 'Мы помогаем',
      text:
        'Для достижения наибольшей эффективности в процессе реализации проекта, сотрудники компании Системные Решения активно взаимодействует с заказчиком, стараясь предложить выбор различных технических средств для решения поставленной задачи, а также наиболее выгодные с точки зрения перестроения существующих бизнес-процессов компании модели внедрения IoT – решений и платформ'
    },
    {
      id: 1,
      title: 'Мы анализируем',
      text:
        'Нашим заказчикам нужен инновационный партнер, который постоянно следит за технологическими новшествами и использует в проектах наиболее перспективные из ни, предлагает IоТ-решения, которые можно с легкостью интегрировать в инфраструктуру предприятия и настроить для решения специфичных для конкретного предприятия задач.'
    },
    {
      id: 2,
      title: 'Мы развиваемся',
      text:
        'Нашим заказчикам нужен инновационный партнер, который постоянно следит за технологическими новшествами и использует в проектах наиболее перспективные из ни, предлагает IоТ-решения, которые можно с легкостью интегрировать в инфраструктуру предприятия и настроить для решения специфичных для конкретного предприятия задач.'
    }
  ]
}

const competences = {
  title:
    'Компетенции сотрудников компании «Системные Решения» позволяют решать широкий спектр инженерных задач в области IoT:',
  cardInfo: [
    {
      id: 0,
      listTitle: 'Проработка архитектуры IoT-решения:',
      listItems: [
        {
          id: 0,
          text: 'анализ требований в соответствии с бизнес-требованиями заказчика;'
        },
        {
          id: 1,
          text: 'разработка архитектуры;'
        },
        {
          id: 2,
          text: 'Solution Engineering;'
        },
        {
          id: 3,
          text: 'Identofication and Evaluation of IoT Platform.'
        }
      ]
    },
    {
      id: 1,
      listTitle: 'Cистемная интеграция:',
      listItems: [
        {
          id: 0,
          text: 'разработка IoT приложений;'
        },
        {
          id: 1,
          text: 'интеграция с существующими ERP, CRM системами;'
        },
        {
          id: 2,
          text: 'интеграция с сервисами SMS и Email рассылки;'
        },
        {
          id: 3,
          text: 'тестирование и проверка.'
        }
      ]
    },
    {
      id: 2,
      listTitle: 'Поддержка и обслуживание',
      listItems: [
        {
          id: 0,
          text: 'поддержка всего парка развернутой IoT-cети;'
        },
        {
          id: 1,
          text: 'масштабирование IoT-решения по запросу заказчика.'
        }
      ]
    },
    {
      id: 3,
      listTitle: 'Проработка архитектуры IoT-решения:',
      listItems: [
        {
          id: 0,
          text: 'анализ требований в соответствии с бизнес-требованиями заказчика;'
        },
        {
          id: 1,
          text: 'разработка архитектуры;'
        },
        {
          id: 2,
          text: 'Solution Engineering;'
        },
        {
          id: 3,
          text: 'Identofication and Evaluation of IoT Platform.'
        }
      ]
    }
  ]
}

const partners = {
  title: 'Наши партнеры',
  subtitle:
    'Установившиеся партнерские взаимоотношения с рядом ведущих отечественных и зарубежных проектных, научных организаций, инжиниринговых компаний, обеспечивают нам возможность реализации под ключ проектов высокой технической сложности',
  cardInfo: [
    {
      id: 0,
      name: 'MECAL Pantheon BV',
      logo: 'mecal',
      href: 'http://www.mecal.eu/'
    },
    {
      id: 1,
      name: 'NORD Engineering company',
      logo: 'nord',
      href: 'http://www.nordengineering.ru/'
    },
    {
      id: 2,
      name: 'МГТУ им. Н.Э.Баумана',
      logo: 'bmstu',
      href: 'http://www.bmstu.ru/'
    },
    {
      id: 3,
      name: 'SIT System Integration Technology AG',
      logo: 'sit',
      href: 'http://www.sit.ch'
    },
    {
      id: 4,
      name: 'IDEAL3',
      logo: 'ideal3',
      href: 'https://www.ideal3.ru/'
    },
    {
      id: 5,
      name: 'ОАО «Ростелеком»',
      logo: 'rostelecom',
      href: 'https://moscow.rt.ru/'
    }
  ]
}

const projects = {
  title: 'Проекты, которыми мы гордимся',
  cardInfo: [
    {
      id: 0,
      text: 'Разработка автоматизированной системы по контролю и обслуживанию инженерной инфрастукрутры'
    },
    {
      id: 1,
      text: 'Создание оптической лаборатории научно-исследовательского и производственного центра ФГУПВНИИА'
    },
    {
      id: 2,
      text: 'Создание научно-исследовательского центра «Функциональные микро/наносистемы»'
    },
    {
      id: 3,
      text: 'Создание лаборатории комплексной плазмы и технологий плазменных покрытий и источников плазмы'
    }
  ]
}

export { headerLinksData, intro, target, coreValues, competences, partners, projects }
