const intro = {
  title: 'Мы соединяем физический и Онлайн миры',
  buttonText: 'Узнать больше'
}

const target = {
  title: 'Наша цель',
  text:
    'Опираясь на многолетний опыт реализации технических решений в области создания информационной технологий для объектов промышленной, информационной и научной инфраструктуры, компания «Системные решения» предоставляет промышленным предприятиям, научным организациям и органам государственной власти полный комплекс инжиниринговых и IT услуг.'
}

const coreValues = {
  title: 'Наши сотрудники',
  cardInfo: [
    {
      id: 0,
      text:
        'Для достижения наибольшей эффективности в процессе реализации проекта, сотрудники компании Системные Решения активно взаимодействует с заказчиком, стараясь предложить выбор различных технических средств для решения поставленной задачи, а также наиболее выгодные с точки зрения перестроения существующих бизнес-процессов компании модели внедрения IoT – решений и платформ'
    },
    {
      id: 1,
      text:
        'Нашим заказчикам нужен инновационный партнер, который постоянно следит за технологическими новшествами и использует в проектах наиболее перспективные из ни, предлагает IоТ-решения, которые можно с легкостью интегрировать в инфраструктуру предприятия и настроить для решения специфичных для конкретного предприятия задач.'
    },
    {
      id: 2,
      text:
        'Нашим заказчикам нужен инновационный партнер, который постоянно следит за технологическими новшествами и использует в проектах наиболее перспективные из ни, предлагает IоТ-решения, которые можно с легкостью интегрировать в инфраструктуру предприятия и настроить для решения специфичных для конкретного предприятия задач.'
    }
  ]
}

const competences = {
  title:
    'Компетенции сотрудников компании «Системные Решения» позволяют решать широкий спектр инженерных задач в области IoT:',
  cardInfo: [
    {
      id: 0,
      listTitle: 'Проработка архитектуры IoT-решения:',
      listItems: [
        {
          id: 0,
          text: 'анализ требований в соответствии с бизнес-требованиями заказчика;'
        },
        {
          id: 1,
          text: 'разработка архитектуры;'
        },
        {
          id: 2,
          text: 'Solution Engineering;'
        },
        {
          id: 3,
          text: 'Identofication and Evaluation of IoT Platform.'
        }
      ]
    },
    {
      id: 1,
      listTitle: 'Cистемная интеграция:',
      listItems: [
        {
          id: 0,
          text: 'разработка IoT приложений;'
        },
        {
          id: 1,
          text: 'интеграция с существующими ERP, CRM системами;'
        },
        {
          id: 2,
          text: 'интеграция с сервисами SMS и Email рассылки;'
        },
        {
          id: 3,
          text: 'тестирование и проверка.'
        }
      ]
    },
    {
      id: 2,
      listTitle: 'Поддержка и обслуживание',
      listItems: [
        {
          id: 0,
          text: 'поддержка всего парка развернутой IoT-cети;'
        },
        {
          id: 1,
          text: 'масштабирование IoT-решения по запросу заказчика.'
        }
      ]
    },
    {
      id: 3,
      listTitle: 'Проработка архитектуры IoT-решения:',
      listItems: [
        {
          id: 0,
          text: 'анализ требований в соответствии с бизнес-требованиями заказчика;'
        },
        {
          id: 1,
          text: 'разработка архитектуры;'
        },
        {
          id: 2,
          text: 'Solution Engineering;'
        },
        {
          id: 3,
          text: 'Identofication and Evaluation of IoT Platform.'
        }
      ]
    }
  ]
}

export { intro, target, coreValues, competences }
